performance_test/FIO/psync/tbox/core2.log
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process
rand_read: Laying out IO file (1 file / 1024MiB)
Jobs: 1 (f=1): [r(1)][100.0%][r=16.3MiB/s][r=4168 IOPS][eta 00m:00s]
rand_read: (groupid=0, jobs=1): err= 0: pid=7011: Mon Apr 21 08:30:59 2025
  read: IOPS=4033, BW=15.8MiB/s (16.5MB/s)(788MiB/50002msec)
    clat (usec): min=151, max=22807, avg=242.20, stdev=326.81
     lat (usec): min=152, max=22807, avg=242.75, stdev=327.01
    clat percentiles (usec):
     |  1.00th=[  163],  5.00th=[  169], 10.00th=[  174], 20.00th=[  182],
     | 30.00th=[  190], 40.00th=[  196], 50.00th=[  200], 60.00th=[  206],
     | 70.00th=[  212], 80.00th=[  227], 90.00th=[  265], 95.00th=[  375],
     | 99.00th=[ 1057], 99.50th=[ 1680], 99.90th=[ 4817], 99.95th=[ 6718],
     | 99.99th=[12387]
   bw (  KiB/s): min=11508, max=17765, per=100.00%, avg=16151.23, stdev=1283.78, samples=99
   iops        : min= 2877, max= 4441, avg=4037.44, stdev=320.92, samples=99
  lat (usec)   : 250=87.70%, 500=9.32%, 750=1.32%, 1000=0.56%
  lat (msec)   : 2=0.71%, 4=0.24%, 10=0.13%, 20=0.02%, 50=0.01%
  cpu          : usr=3.36%, sys=18.03%, ctx=203253, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=201663,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=15.8MiB/s (16.5MB/s), 15.8MiB/s-15.8MiB/s (16.5MB/s-16.5MB/s), io=788MiB (826MB), run=50002-50002msec

Disk stats (read/write):
  vda: ios=201341/28, merge=0/11, ticks=40874/13, in_queue=40894, util=83.91%
rand_wr: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process
Jobs: 1 (f=1): [w(1)][100.0%][w=25.4MiB/s][w=6499 IOPS][eta 00m:00s]
rand_wr: (groupid=0, jobs=1): err= 0: pid=7123: Mon Apr 21 08:31:49 2025
  write: IOPS=6392, BW=25.0MiB/s (26.2MB/s)(1249MiB/50001msec); 0 zone resets
    clat (usec): min=82, max=15910, avg=150.30, stdev=288.87
     lat (usec): min=82, max=15924, avg=151.07, stdev=291.48
    clat percentiles (usec):
     |  1.00th=[   95],  5.00th=[   98], 10.00th=[  100], 20.00th=[  104],
     | 30.00th=[  109], 40.00th=[  111], 50.00th=[  115], 60.00th=[  119],
     | 70.00th=[  124], 80.00th=[  133], 90.00th=[  163], 95.00th=[  262],
     | 99.00th=[  840], 99.50th=[ 1303], 99.90th=[ 4080], 99.95th=[ 6259],
     | 99.99th=[11207]
   bw (  KiB/s): min=17880, max=28976, per=100.00%, avg=25589.34, stdev=2239.87, samples=99
   iops        : min= 4470, max= 7244, avg=6396.95, stdev=559.95, samples=99
  lat (usec)   : 100=9.26%, 250=85.44%, 500=3.55%, 750=0.64%, 1000=0.30%
  lat (msec)   : 2=0.54%, 4=0.17%, 10=0.09%, 20=0.02%
  cpu          : usr=5.52%, sys=30.08%, ctx=319144, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,319623,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=25.0MiB/s (26.2MB/s), 25.0MiB/s-25.0MiB/s (26.2MB/s-26.2MB/s), io=1249MiB (1309MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=6/317954, merge=0/22, ticks=1/36906, in_queue=36932, util=76.95%
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=14.2MiB/s][r=3642 IOPS][eta 00m:00s]
rand_read: (groupid=0, jobs=1): err= 0: pid=7246: Mon Apr 21 08:32:39 2025
  read: IOPS=3758, BW=14.7MiB/s (15.4MB/s)(734MiB/50001msec)
    clat (usec): min=156, max=18397, avg=260.23, stdev=318.07
     lat (usec): min=156, max=18398, avg=260.79, stdev=318.31
    clat percentiles (usec):
     |  1.00th=[  163],  5.00th=[  169], 10.00th=[  176], 20.00th=[  188],
     | 30.00th=[  196], 40.00th=[  202], 50.00th=[  210], 60.00th=[  227],
     | 70.00th=[  249], 80.00th=[  273], 90.00th=[  306], 95.00th=[  400],
     | 99.00th=[ 1106], 99.50th=[ 1680], 99.90th=[ 4817], 99.95th=[ 6849],
     | 99.99th=[11207]
   bw (  KiB/s): min=11101, max=16588, per=100.00%, avg=15046.89, stdev=952.27, samples=99
   iops        : min= 2775, max= 4147, avg=3761.35, stdev=238.07, samples=99
  lat (usec)   : 250=70.55%, 500=26.25%, 750=1.46%, 1000=0.57%
  lat (msec)   : 2=0.77%, 4=0.25%, 10=0.14%, 20=0.01%
  cpu          : usr=3.12%, sys=16.83%, ctx=189400, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=187927,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=14.7MiB/s (15.4MB/s), 14.7MiB/s-14.7MiB/s (15.4MB/s-15.4MB/s), io=734MiB (770MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=187050/29, merge=0/12, ticks=41343/11, in_queue=41360, util=84.99%
rand_wr: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process
Jobs: 1 (f=1): [w(1)][100.0%][w=25.6MiB/s][w=6550 IOPS][eta 00m:00s]
rand_wr: (groupid=0, jobs=1): err= 0: pid=7320: Mon Apr 21 08:33:30 2025
  write: IOPS=6393, BW=25.0MiB/s (26.2MB/s)(1249MiB/50001msec); 0 zone resets
    clat (usec): min=81, max=19209, avg=150.20, stdev=285.37
     lat (usec): min=81, max=19209, avg=150.84, stdev=285.69
    clat percentiles (usec):
     |  1.00th=[   95],  5.00th=[   98], 10.00th=[  100], 20.00th=[  104],
     | 30.00th=[  108], 40.00th=[  111], 50.00th=[  114], 60.00th=[  118],
     | 70.00th=[  123], 80.00th=[  133], 90.00th=[  163], 95.00th=[  265],
     | 99.00th=[  848], 99.50th=[ 1319], 99.90th=[ 4113], 99.95th=[ 6259],
     | 99.99th=[10814]
   bw (  KiB/s): min=17741, max=28405, per=100.00%, avg=25596.66, stdev=2121.09, samples=99
   iops        : min= 4435, max= 7101, avg=6398.79, stdev=530.25, samples=99
  lat (usec)   : 100=10.01%, 250=84.61%, 500=3.60%, 750=0.67%, 1000=0.29%
  lat (msec)   : 2=0.55%, 4=0.17%, 10=0.09%, 20=0.01%
  cpu          : usr=5.73%, sys=29.83%, ctx=319223, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,319663,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=25.0MiB/s (26.2MB/s), 25.0MiB/s-25.0MiB/s (26.2MB/s-26.2MB/s), io=1249MiB (1309MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=5/318046, merge=0/21, ticks=2/37025, in_queue=37058, util=76.32%
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=13.9MiB/s][r=3554 IOPS][eta 00m:00s]
rand_read: (groupid=0, jobs=1): err= 0: pid=7443: Mon Apr 21 08:34:20 2025
  read: IOPS=3601, BW=14.1MiB/s (14.8MB/s)(703MiB/50003msec)
    clat (usec): min=152, max=17615, avg=272.06, stdev=311.32
     lat (usec): min=152, max=17616, avg=272.65, stdev=311.77
    clat percentiles (usec):
     |  1.00th=[  165],  5.00th=[  174], 10.00th=[  186], 20.00th=[  196],
     | 30.00th=[  206], 40.00th=[  217], 50.00th=[  227], 60.00th=[  239],
     | 70.00th=[  260], 80.00th=[  285], 90.00th=[  322], 95.00th=[  416],
     | 99.00th=[ 1106], 99.50th=[ 1729], 99.90th=[ 4752], 99.95th=[ 5997],
     | 99.99th=[10552]
   bw (  KiB/s): min=10738, max=16206, per=100.00%, avg=14421.24, stdev=949.71, samples=99
   iops        : min= 2684, max= 4051, avg=3604.93, stdev=237.46, samples=99
  lat (usec)   : 250=66.08%, 500=30.49%, 750=1.64%, 1000=0.59%
  lat (msec)   : 2=0.76%, 4=0.28%, 10=0.14%, 20=0.01%
  cpu          : usr=2.99%, sys=16.14%, ctx=181486, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=180073,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=14.1MiB/s (14.8MB/s), 14.1MiB/s-14.1MiB/s (14.8MB/s-14.8MB/s), io=703MiB (738MB), run=50003-50003msec

Disk stats (read/write):
  vda: ios=179215/33, merge=0/13, ticks=41735/14, in_queue=41757, util=85.97%
rand_wr: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process
Jobs: 1 (f=1): [w(1)][100.0%][w=22.9MiB/s][w=5866 IOPS][eta 00m:00s]
rand_wr: (groupid=0, jobs=1): err= 0: pid=7523: Mon Apr 21 08:35:10 2025
  write: IOPS=6318, BW=24.7MiB/s (25.9MB/s)(1234MiB/50001msec); 0 zone resets
    clat (usec): min=80, max=23053, avg=152.18, stdev=316.09
     lat (usec): min=80, max=23054, avg=152.87, stdev=316.87
    clat percentiles (usec):
     |  1.00th=[   94],  5.00th=[   98], 10.00th=[  100], 20.00th=[  104],
     | 30.00th=[  108], 40.00th=[  111], 50.00th=[  114], 60.00th=[  118],
     | 70.00th=[  123], 80.00th=[  133], 90.00th=[  165], 95.00th=[  265],
     | 99.00th=[  906], 99.50th=[ 1336], 99.90th=[ 4883], 99.95th=[ 6652],
     | 99.99th=[11863]
   bw (  KiB/s): min=17821, max=28388, per=100.00%, avg=25299.40, stdev=2148.90, samples=99
   iops        : min= 4455, max= 7097, avg=6324.54, stdev=537.23, samples=99
  lat (usec)   : 100=10.29%, 250=84.35%, 500=3.55%, 750=0.65%, 1000=0.30%
  lat (msec)   : 2=0.55%, 4=0.16%, 10=0.12%, 20=0.02%, 50=0.01%
  cpu          : usr=5.51%, sys=29.68%, ctx=315437, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,315940,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=24.7MiB/s (25.9MB/s), 24.7MiB/s-24.7MiB/s (25.9MB/s-25.9MB/s), io=1234MiB (1294MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=6/314401, merge=0/27, ticks=1/36768, in_queue=36786, util=76.67%